In [59]:
import pandas as pd
import numpy as np

In [60]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [61]:
multi_index = pd.MultiIndex.from_tuples(index, names=['state', 'year'])
multi_index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['state', 'year'])

In [62]:
pop = pd.Series(populations, index=multi_index)
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [63]:
pop[:, 2010]

state
California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [64]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
state      year
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [65]:
multi_index_3 = pd.MultiIndex.from_tuples([('A1', 'B1', 'C1'),
                                           ('A1', 'B1', 'C2'),
                                           ('A1', 'B2', 'C1'),
                                           ('A1', 'B2', 'C2'),
                                           ('A2', 'B1', 'C1'),
                                           ('A2', 'B1', 'C2'),
                                           ('A2', 'B2', 'C1'),
                                           ('A2', 'B2', 'C2')])
multi_index_3

MultiIndex(levels=[['A1', 'A2'], ['B1', 'B2'], ['C1', 'C2']],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 0, 1, 1, 0, 0, 1, 1], [0, 1, 0, 1, 0, 1, 0, 1]])

In [66]:
data = ['A1B1C1', 'A1B1C2', 'A1B2C1', 'A1B2C2', 'A2B1C1', 'A2B1C2', 'A2B2C1', 'A2B2C2']
ds_3 = pd.Series(data, index=multi_index_3)
ds_3

A1  B1  C1    A1B1C1
        C2    A1B1C2
    B2  C1    A1B2C1
        C2    A1B2C2
A2  B1  C1    A2B1C1
        C2    A2B1C2
    B2  C1    A2B2C1
        C2    A2B2C2
dtype: object

In [67]:
ds_3.unstack()

           C1      C2
A1 B1  A1B1C1  A1B1C2
   B2  A1B2C1  A1B2C2
A2 B1  A2B1C1  A2B1C2
   B2  A2B2C1  A2B2C2

In [68]:
multi_index_p3 = pd.MultiIndex.from_product([['A1', 'A2'], ['B1', 'B2'], ['C1', 'C2']], names=['As', 'Bs', 'Cs'])
ds_p3 = pd.Series(data, index=multi_index_p3)
ds_p3.unstack()

Cs         C1      C2
As Bs
A1 B1  A1B1C1  A1B1C2
   B2  A1B2C1  A1B2C2
A2 B1  A2B1C1  A2B1C2
   B2  A2B2C1  A2B2C2

In [69]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [70]:
pop['California', 2000]

33871648

In [71]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [72]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [73]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [75]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [76]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      27.0  36.7  47.0  35.7  41.0  37.2
     2      23.0  38.1  43.0  37.8  47.0  35.9
2014 1      22.0  34.3  38.0  37.2  25.0  37.9
     2      27.0  37.1  28.0  36.2  45.0  37.0

In [77]:
health_data['Guido', 'HR']

year  visit
2013  1        47.0
      2        43.0
2014  1        38.0
      2        28.0
Name: (Guido, HR), dtype: float64

In [88]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      27.0  36.7
     2      23.0  38.1

In [89]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        27.0
      2        23.0
2014  1        22.0
      2        27.0
Name: (Bob, HR), dtype: float64

In [94]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      27.0  47.0  41.0
2014 1      22.0  38.0  25.0

In [95]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.989524
      2      0.059429
c     1      0.455462
      2      0.413452
b     1      0.152904
      2      0.213676
dtype: float64

In [96]:
data = data.sort_index()
data

char  int
a     1      0.989524
      2      0.059429
b     1      0.152904
      2      0.213676
c     1      0.455462
      2      0.413452
dtype: float64

In [97]:
data['a':'b']

char  int
a     1      0.989524
      2      0.059429
b     1      0.152904
      2      0.213676
dtype: float64

In [98]:
data.unstack()

int          1         2
char
a     0.989524  0.059429
b     0.152904  0.213676
c     0.455462  0.413452

In [100]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [101]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [103]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [106]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [107]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      27.0  36.7  47.0  35.7  41.0  37.2
     2      23.0  38.1  43.0  37.8  47.0  35.9
2014 1      22.0  34.3  38.0  37.2  25.0  37.9
     2      27.0  37.1  28.0  36.2  45.0  37.0

In [108]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     25.0  37.4  45.0  36.75  44.0  36.55
2014     24.5  35.7  33.0  36.70  35.0  37.45

In [111]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  38.000000  36.900000
2014  30.833333  36.616667